#pragma once
#ifndef ascii
#define ascii

#include <iostream>
#include <string>
#include <deque>
#include "Tools.h"
#include "ASCII.h"

// Invalid or unnecessary characters are replaced with a space.


namespace ASCII {
	const char ASCIIchrs[224] = {' ','!','"','#','$','%','&','\'','(',')','*','+',',','-','.','/','0','1','2','3',
	'4','5','6','7','8','9',':',';','<','=','>','?','@','A','B','C','D','E','F','G','H','I','J','K','L','M','N','O',
	'P','Q','R','S','T','U','V','W','X','Y','Z','[',' ',']','^','_','`','a','b','c','d','e','f','g','h','i','j','k',
	'l','m','n','o','p','q','r','s','t','u','v','w','x','y','z','{','|','}','~',' ',' ',' ',' ',' ',',',' ','„','…',
	' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',
	' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',
	'А','Б','В','Г','Д','Е','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ъ',
	'Ы','Ь','Э','Ю','Я','а','б','в','г','д','е','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч',
	'ш','щ','ъ','ы','ь','э','ю','я' };


	char GetASCII(int num) {
		if (num < 32) {
			return ' ';
		}
		return ASCIIchrs[num - 32];
	}

	int GetASCIINumber(char chr) {
		for (int i = 0;i < 224;++i) {
			if (chr == ASCIIchrs[i]) {
				return i + 32;
			}
		}
	}
}
#endif
